**NAMA = Mitra Marona Putra Gurusinga**

PBI Kalbe Data Engineer Oktober 2023

FINAL TASK NO 4 DAN 5

# FINAL TASK NO 4. Convert this instruction into SQL Query Language

## Library Load and Installation

In [ ]:
pip install ipython-sql mysql-connector-python

Requirement already satisfied: ipython-sql in /Users/mitrampg/anaconda3/lib/python3.11/site-packages (0.5.0)
Requirement already satisfied: mysql-connector-python in /Users/mitrampg/anaconda3/lib/python3.11/site-packages (8.1.0)
Requirement already satisfied: prettytable in /Users/mitrampg/anaconda3/lib/python3.11/site-packages (from ipython-sql) (3.9.0)
Requirement already satisfied: ipython in /Users/mitrampg/anaconda3/lib/python3.11/site-packages (from ipython-sql) (8.12.0)
Requirement already satisfied: sqlalchemy>=2.0 in /Users/mitrampg/anaconda3/lib/python3.11/site-packages (from ipython-sql) (2.0.22)
Requirement already satisfied: sqlparse in /Users/mitrampg/anaconda3/lib/python3.11/site-packages (from ipython-sql) (0.4.4)
Requirement already satisfied: six in /Users/mitrampg/anaconda3/lib/python3.11/site-packages (from ipython-sql) (1.16.0)
Requirement already satisfied: ipython-genutils in /Users/mitrampg/anaconda3/lib/python3.11/site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: protobuf<=4.21.12,>=4.21.1 in /Users/mitrampg/anaconda3/lib/python3.11/site-packages (from mysql-connector-python) (4.21.12)
Requirement already satisfied: typing-extensions>=4.2.0 in /Users/mitrampg/anaconda3/lib/python3.11/site-packages (from sqlalchemy>=2.0->ipython-sql) (4.7.1)
Requirement already satisfied: backcall in /Users/mitrampg/anaconda3/lib/python3.11/site-packages (from ipython->ipython-sql) (0.2.0)
Requirement already satisfied: decorator in /Users/mitrampg/anaconda3/lib/python3.11/site-packages (from ipython->ipython-sql) (5.1.1)
Requirement already satisfied: jedi>=0.16 in /Users/mitrampg/anaconda3/lib/python3.11/site-packages (from ipython->ipython-sql) (0.18.1)
Requirement already satisfied: matplotlib-inline in /Users/mitrampg/anaconda3/lib/python3.11/site-packages (from ipython->ipython-sql) (0.1.6)
Requirement already satisfied: pickleshare in /Users/mitrampg/anaconda3/lib/python3.11/site-packages (from ipython->ipython-sql) (0.7.5)
Requirement already satisfied: prompt-toolkit!=3.0.37,<3.1.0,>=3.0.30 in /Users/mitrampg/anaconda3/lib/python3.11/site-packages (from ipython->ipython-sql) (3.0.36)
Requirement already satisfied: pygments>=2.4.0 in /Users/mitrampg/anaconda3/lib/python3.11/site-packages (from ipython->ipython-sql) (2.15.1)
Requirement already satisfied: stack-data in /Users/mitrampg/anaconda3/lib/python3.11/site-packages (from ipython->ipython-sql) (0.2.0)
Requirement already satisfied: traitlets>=5 in /Users/mitrampg/anaconda3/lib/python3.11/site-packages (from ipython->ipython-sql) (5.7.1)
Requirement already satisfied: pexpect>4.3 in /Users/mitrampg/anaconda3/lib/python3.11/site-packages (from ipython->ipython-sql) (4.8.0)
Requirement already satisfied: appnope in /Users/mitrampg/anaconda3/lib/python3.11/site-packages (from ipython->ipython-sql) (0.1.2)
Requirement already satisfied: wcwidth in /Users/mitrampg/anaconda3/lib/python3.11/site-packages (from prettytable->ipython-sql) (0.2.5)
Requirement already satisfied: parso<0.9.0,>=0.8.0 in /Users/mitrampg/anaconda3/lib/python3.11/site-packages (from jedi>=0.16->ipython->ipython-sql) (0.8.3)
Requirement already satisfied: ptyprocess>=0.5 in /Users/mitrampg/anaconda3/lib/python3.11/site-packages (from pexpect>4.3->ipython->ipython-sql) (0.7.0)
Requirement already satisfied: executing in /Users/mitrampg/anaconda3/lib/python3.11/site-packages (from stack-data->ipython->ipython-sql) (0.8.3)
Requirement already satisfied: asttokens in /Users/mitrampg/anaconda3/lib/python3.11/site-packages (from stack-data->ipython->ipython-sql) (2.0.5)
Requirement already satisfied: pure-eval in /Users/mitrampg/anaconda3/lib/python3.11/site-packages (from stack-data->ipython->ipython-sql) (0.2.2)
Note: you may need to restart the kernel to use updated packages.

In [ ]:
%load_ext sql

In [ ]:
#password hidden
%sql mysql+mysqlconnector://root:****@localhost:3306

## 1. Create a database with ‘KALBE’ as the name

In [ ]:
%%sql
CREATE DATABASE KALBE;

 * mysql+mysqlconnector://root:***@localhost:3306
1 rows affected.

[]

In [ ]:
%%sql
USE KALBE;

 * mysql+mysqlconnector://root:***@localhost:3306
0 rows affected.

[]

## 2. Creating the 'Inventory' Table

Inside the database, create a table with the name ‘Inventory’, with columns `Item_code`, `Item_name`, `Item_price`, and `Item_total`.
Choose its own best data type and the length of it according to best practice.
Choose one unique column as a primary key and decide columns constraints.

In [ ]:
%%sql
CREATE TABLE Inventory (
    Item_code INT PRIMARY KEY,
    Item_name VARCHAR(255) NOT NULL,
    Item_price DECIMAL(10,2) NOT NULL,
    Item_total DECIMAL(10,2) NOT NULL
);

 * mysql+mysqlconnector://root:***@localhost:3306
0 rows affected.

[]

# 3.  Insert sheet name "No 4" from Dataset Final Project KN-DE.xlsx file into the table

In [ ]:
%%sql
INSERT INTO Inventory (Item_code, Item_name, Item_price, Item_total)
VALUES
(2341, 'Promag Tablet', 3000.0, 100.0),
(2342, 'Hydro Coco 250ML', 7000.0, 20.0),
(2343, 'Nutrive Benecol 100ML', 20000.0, 30.0),
(2344, 'Blackmores Vit C 500Mg', 95000.0, 45.0),
(2345, 'Entrasol Gold 370G', 90000.0, 120.0)

 * mysql+mysqlconnector://root:***@localhost:3306
5 rows affected.

[]

In [ ]:
%%sql
SELECT * FROM Inventory;

 * mysql+mysqlconnector://root:***@localhost:3306
5 rows affected.

[(2341, 'Promag Tablet', Decimal('3000.00'), Decimal('100.00')),
 (2342, 'Hydro Coco 250ML', Decimal('7000.00'), Decimal('20.00')),
 (2343, 'Nutrive Benecol 100ML', Decimal('20000.00'), Decimal('30.00')),
 (2344, 'Blackmores Vit C 500Mg', Decimal('95000.00'), Decimal('45.00')),
 (2345, 'Entrasol Gold 370G', Decimal('90000.00'), Decimal('120.00'))]

## 4. Show Item_name that has the highest number in Item_total.

In [ ]:
%%sql
SELECT
Item_name
FROM Inventory
ORDER BY Item_total DESC
LIMIT 1;

 * mysql+mysqlconnector://root:***@localhost:3306
1 rows affected.

[('Entrasol Gold 370G',)]

## 5. Update the Item_price of the output of question bullet

In [ ]:
%%sql
WITH MaxTotalItem AS (
    SELECT
    Item_name
    FROM Inventory
    ORDER BY Item_total DESC
    LIMIT 1
)
UPDATE Inventory
SET Item_price = 100000
WHERE Item_name = (SELECT Item_name FROM MaxTotalItem);

 * mysql+mysqlconnector://root:***@localhost:3306
1 rows affected.

[]

In [ ]:
%%sql
SELECT * FROM Inventory;

 * mysql+mysqlconnector://root:***@localhost:3306
5 rows affected.

[(2341, 'Promag Tablet', Decimal('3000.00'), Decimal('100.00')),
 (2342, 'Hydro Coco 250ML', Decimal('7000.00'), Decimal('20.00')),
 (2343, 'Nutrive Benecol 100ML', Decimal('20000.00'), Decimal('30.00')),
 (2344, 'Blackmores Vit C 500Mg', Decimal('95000.00'), Decimal('45.00')),
 (2345, 'Entrasol Gold 370G', Decimal('100000.00'), Decimal('120.00'))]

## 6. What will happen if we insert another Item_name with Item_code of 2343 into the table?

In [ ]:
%%sql
INSERT INTO Inventory (Item_code, Item_name, Item_price, Item_total)
VALUES
(2343, 'Tes Tablet', 240000.0, 70.0)

 * mysql+mysqlconnector://root:***@localhost:3306
(mysql.connector.errors.IntegrityError) 1062 (23000): Duplicate entry '2343' for key 'inventory.PRIMARY'
[SQL: INSERT INTO Inventory (Item_code, Item_name, Item_price, Item_total)
VALUES
(2343, 'Tes Tablet', 240000.0, 70.0)]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

```
Query ini akan mengeluarkan error output, karena ada berusaha memasukkan data duplikat '2343' di kolom item code yang merupakan primary key. Di mana nilai dari primary key ini harus unik di setiap baris dalam tabel.```

## 7. Delete the Item_name that has the lowest number of Item_total.

In [ ]:
%%sql
SET @min_total = (SELECT MIN(Item_total) FROM Inventory);
DELETE FROM Inventory WHERE Item_total = @min_total;

 * mysql+mysqlconnector://root:***@localhost:3306
0 rows affected.
1 rows affected.

[]

In [ ]:
%%sql
SELECT * FROM Inventory;

 * mysql+mysqlconnector://root:***@localhost:3306
4 rows affected.

[(2341, 'Promag Tablet', Decimal('3000.00'), Decimal('100.00')),
 (2343, 'Nutrive Benecol 100ML', Decimal('20000.00'), Decimal('30.00')),
 (2344, 'Blackmores Vit C 500Mg', Decimal('95000.00'), Decimal('45.00')),
 (2345, 'Entrasol Gold 370G', Decimal('100000.00'), Decimal('120.00'))]

# FINAL TASK NO 5.  Create a Query to display all customer orders
Where purchase amount is less than 100 or exclude those
orders which order date is on or greater than 25 Aug
2022 and customer id is above 2001.

## STEP 1 : Create Table Orders

In [ ]:
%%sql
CREATE TABLE Orders (
    order_no INT PRIMARY KEY,
    purchase_amount DECIMAL(10,2) NOT NULL,
    order_date DATE NOT NULL,
    customer_id INT,
    salesman_id INT
);

 * mysql+mysqlconnector://root:***@localhost:3306
0 rows affected.

[]

In [ ]:
%%sql
INSERT INTO Orders (order_no, purchase_amount, order_date, customer_id, salesman_id)
VALUES
(10001, 150.0, '2022-10-05', 2005, 3002),
(10009, 279.0, '2022-09-10', 2001, 3005),
(10002, 65.0, '2022-10-05', 2002, 3001),
(10004, 110.0, '2022-08-17', 2009, 3003),
(10007, 948.0, '2022-09-10', 2005, 3002);

 * mysql+mysqlconnector://root:***@localhost:3306
5 rows affected.

[]

In [ ]:
%%sql
SELECT * FROM Orders;

 * mysql+mysqlconnector://root:***@localhost:3306
5 rows affected.

[(10001, Decimal('150.00'), datetime.date(2022, 10, 5), 2005, 3002),
 (10002, Decimal('65.00'), datetime.date(2022, 10, 5), 2002, 3001),
 (10004, Decimal('110.00'), datetime.date(2022, 8, 17), 2009, 3003),
 (10007, Decimal('948.00'), datetime.date(2022, 9, 10), 2005, 3002),
 (10009, Decimal('279.00'), datetime.date(2022, 9, 10), 2001, 3005)]

## STEP 2: CREATE QUERY

In [ ]:
%%sql
SELECT *
FROM Orders
WHERE
purchase_amount < 100 OR
(NOT (order_date >= '2022-08-25' AND customer_id > 2001));

 * mysql+mysqlconnector://root:***@localhost:3306
3 rows affected.

[(10002, Decimal('65.00'), datetime.date(2022, 10, 5), 2002, 3001),
 (10004, Decimal('110.00'), datetime.date(2022, 8, 17), 2009, 3003),
 (10009, Decimal('279.00'), datetime.date(2022, 9, 10), 2001, 3005)]